[
    {
      "title": "Deep Learning For GeoLocassting Street Level Imagery",

      "subtitle": "2024-2025 Master's Project",
      "items": [
        {
          "type": "paragraph",
          "text": "It turns out that there's enough Pre-trained models floating around that we can skip to the fun stuff. This project creates a psuedo ensemble of Machine Learning Models for GeoLocalization of Street level Imagery at the Multi-Neighbourhood scale. "
        },


        {
            "type": "paragraph",
            "text": "Existing Models focus on broader scales, this psuedo ensemble of models forms a last hop in a broader GeoLocalization Model"
          },
        {
          "type": "image",
          "src": "assets/images/home_vintage.gif",
          "alt": "Street level Imagery"
        },
        {
          "type": "paragraph",
          "text": "The methodology involves extracting and analysing GeoInformative Features using fine-tuned object detection models to identify geographic indicators, such as signage, crosswalks, and architectural elements. Optical Character Recognition (OCR) is used to extract text, which is then transformed into higher-dimensional embeddings using a pre-trained text embedding model. Colour distributions, indicative of geographic location, are captured using HSV histogram embeddings. Three machine learning models are employed to geolocate an unseen image: K-means clustering, a CNN with Attention, and a Multi-Dense Network with Attention."        },
        {
          "type": "highlight",
          "text": "Python, Tensorflow, Keras, all that stuff"
        },
        {
          "type": "paragraph",
          "text": "From a datset of 150,510 images, we achieved accuracy of 1.3km (approx) for a 20km^2 candidate area. The overall project graded as an A through the University of Canterbury"
        },
        {
          "type": "image",
          "src": "/assets/images/default.png",
          "alt": "AI in Finance"
        },
        {
          "type": "paragraph",
          "text": "As AI continues to evolve, it is essential to address the ethical implications of its use. Issues such as data privacy, bias in algorithms, and job displacement need to be carefully managed."
        }
      ],
      "link": {
        "text": "Read the full report",
        "url": "https://example.com/ai-report"
      }
    },
    {
      "title": "Empty Space",
      "subtitle": "The urgent need for action",
      "items": [
        {
          "type": "paragraph",
          "text": "Climate change is one of the most pressing challenges facing humanity today. Rising global temperatures, melting ice caps, and extreme weather events are clear signs of the crisis."
        },
        {
          "type": "image",
          "src": "/assets/images/climate_change.jpg",
          "alt": "Climate Change"
        },
        {
          "type": "paragraph",
          "text": "Scientists warn that if we do not take immediate action, the consequences could be catastrophic. This includes the loss of biodiversity, food shortages, and displacement of millions of people."
        },
        {
          "type": "highlight",
          "text": "Fact: The last decade was the hottest on record."
        },
        {
          "type": "paragraph",
          "text": "Governments, businesses, and individuals all have a role to play in combating climate change. Renewable energy, sustainable agriculture, and reducing carbon footprints are key areas of focus."
        },
        {
          "type": "image",
          "src": "/assets/images/renewable_energy.jpg",
          "alt": "Renewable Energy"
        }
      ],
      "link": {
        "text": "Learn how you can help",
        "url": "https://example.com/climate-action"
      }
    },

    {
        "title": "About Me",
        "subtitle": "Thingies",
        "items": [
          {
            "type": "paragraph",
            "text": "Ipplying AI to real-world challenges, such asblh blah blah."
          },
          {"type" :  "pills",
            "pills" : ["Full Stack", "Data Processing", "Big Data", "Machine Learning", "Model Development and Analysis", "M365", "Azure Appliances", "Google Admin", "Network Design"]
   
        }
        ],

        "qualifications": [
          {
            "type": "qualification",
            "title": "Master of Artificial Intelligence",
            "institution": "University Of Canterbury",
            "year": "2025"
          },
          {
            "type": "qualification",
            "title": "BSc Computer Science",
            "institution": "Unviersity of Canterbury",
            "year": "2020"
          },
          {
            "type": "qualification",
            "title": "BSc Computer Science",
            "institution": "Unviersity of Canterbury",
            "year": "2020"
          }


        ],
        "link": {
          "text": "View my portfolio",
          "url": "https://example.com/portfolio"
        }
      }


  ]
  